package com.sotcha.apagoreushsms.model

data class Reason(
    val id: Int,
    val smallDescription: String,
    val description: String
) {

    companion object {
        val LIST = listOf<Reason>(
            Reason(
                1,
                "ΦΑΡΜΑΚΕΙΟ Η ΓΙΑΤΡΟ",
                "Μετάβαση σε φαρμακείο ή επίσκεψη στον γιατρό, εφόσον αυτό συνιστάται μετά από σχετική επικοινωνία."
            ),
            Reason(
                2,
                "ΠΡΟΜΗΘΕΙΕΣ - ΦΟΥΡΝΟΣ - ΣΟΥΠΕΡΜΑΚΕΤ",
                "Μετάβαση σε εν λειτουργία κατάστημα προμηθειών αγαθών πρώτης ανάγκης, όπου δεν είναι δυνατή η αποστολή τους."
            ),
            Reason(
                3,
                "ΤΡΑΠΕΖΑ",
                "Μετάβαση στην τράπεζα, στο μέτρο που δεν είναι δυνατή η ηλεκτρονική συναλλαγή."
            ),
            Reason(
                4,
                "ΒΟΗΘΕΙΑ ΣΕ ΑΝΘΡΩΠΟΥΣ",
                "Κίνηση για παροχή βοήθειας σε ανθρώπους που βρίσκονται σε ανάγκη."
            ),
            Reason(
                5,
                "ΤΕΛΕΤΗ - ΚΗΔΕΙΑ - ΓΑΜΟΣ - ΒΑΦΤΙΣΗ",
                "Μετάβαση σε τελετή (π.χ. κηδεία, γάμος, βάφτιση) ."
            ),

            Reason(
                6,
                "ΣΩΜΑΤΙΚΗ ΑΣΚΗΣΗ - ΒΟΛΤΑ ΜΕ ΚΑΤΟΙΚΙΔΙΟ",
                "Σωματική άσκηση σε εξωτερικό χώρο ή κίνηση με κατοικίδιο ζώο."
            )

        )
    }

}





